; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Hanoi Tower
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(define (domain HANOI)
	(:requirements :strips :typing :negative-preconditions)
	(:types disk case)
	(:predicates
		(on_disk ?d1 - disk ?d2 - disk)
		(bigger ?d1 - disk ?d2 - disk)
		(on_case ?d1 - disk ?c - case)
		(clear_disk ?d - disk)
		(clear_case ?c - case)
		(handempty)
		(holding ?d - disk)
	)

	(:action pick_up
		 :parameters (?d - disk ?c - case)
	     	 :precondition (and (clear_disk ?d) (on_case ?d ?c) (handempty))
	     	 :effect
	     	 (and (not (on_case ?d ?c))
		      (clear_case ?c)
		      (not (clear_disk ?d))
		      (not (handempty))
		      (holding ?d)
		 )
	)
	(:action unstack
 		 :parameters (?d - disk ?d2 - disk)
	     	 :precondition (and (clear_disk ?d) (on_disk ?d ?d2) (handempty))
	     	 :effect
	     	 (and (not (on_disk ?d ?d2))
		      (not (clear_disk ?d))
		      	   (clear_disk ?d2)
		      (not (handempty))
		      (holding ?d)
		 )
	)

	(:action put_down
		 :parameters (?d - disk ?c - case)
		 :precondition (and (clear_case ?c) (holding ?d) )
		 :effect
		 (and (not (clear_case ?c))
		      (not (holding ?d))
		      (clear_disk ?d)
		      (on_case ?d ?c)
		      (handempty)
		 )
	)

	(:action stack
		 :parameters (?d1 - disk ?d2 - disk)
		 :precondition (and (clear_disk ?d2) (holding ?d1) (bigger ?d2 ?d1))
		 :effect
		 (and (not (clear_disk ?d2))
		      (not (holding ?d1))
		      (on_disk ?d1 ?d2)
		      (clear_disk ?d1)
		      (handempty)
		 )
	)
)

; problem
(define (problem HANOI_4)
(:domain HANOI)
(:objects D1 D2 D3 D4 D5 - disk
	  C1 C2 C3 - case
)
(:init
	(handempty)
	(bigger D1 D2)
	(bigger D1 D3)
	(bigger D1 D4)
	(bigger D1 D5)
	(bigger D2 D3)
	(bigger D2 D4)
	(bigger D2 D5)
	(bigger D3 D4)
	(bigger D3 D5)
	(bigger D4 D5)
	(clear_case C1)
	(clear_case C2)
	(on_case D1 C3)
	(on_disk D2 D1)
	(on_disk D3 D2)
	(on_disk D4 D3)
	(on_disk D5 D4)
	(clear_disk D5)
)
(:goal
	(and (clear_case C3)
	     (clear_case C2)
	     (on_case D1 C1)
	     (on_disk D2 D1)
	     (on_disk D3 D2)
	     (on_disk D4 D3)
	     (on_disk D5 D4)	
	     (handempty)
	)
))

; plan
1. (unstack d5 d4)
   deleted: (on_disk d5 d4) (clear_disk d5) (handempty)
   added: (clear_disk d4) (holding d5)
   goals met: 4 of 8
2. (put_down d5 c1)
   deleted: (clear_case c1) (holding d5)
   added: (clear_disk d5) (on_case d5 c1) (handempty)
   goals met: 5 of 8
3. (unstack d4 d3)
   deleted: (on_disk d4 d3) (clear_disk d4) (handempty)
   added: (clear_disk d3) (holding d4)
   goals met: 3 of 8
4. (put_down d4 c2)
   deleted: (clear_case c2) (holding d4)
   added: (clear_disk d4) (on_case d4 c2) (handempty)
   goals met: 3 of 8
5. (pick_up d5 c1)
   deleted: (on_case d5 c1) (clear_disk d5) (handempty)
   added: (clear_case c1) (holding d5)
   goals met: 2 of 8
6. (stack d5 d4)
   deleted: (clear_disk d4) (holding d5)
   added: (on_disk d5 d4) (clear_disk d5) (handempty)
   goals met: 4 of 8
7. (unstack d3 d2)
   deleted: (on_disk d3 d2) (clear_disk d3) (handempty)
   added: (clear_disk d2) (holding d3)
   goals met: 2 of 8
8. (put_down d3 c1)
   deleted: (clear_case c1) (holding d3)
   added: (clear_disk d3) (on_case d3 c1) (handempty)
   goals met: 3 of 8
9. (unstack d5 d4)
   deleted: (on_disk d5 d4) (clear_disk d5) (handempty)
   added: (clear_disk d4) (holding d5)
   goals met: 1 of 8
10. (stack d5 d2)
   deleted: (clear_disk d2) (holding d5)
   added: (on_disk d5 d2) (clear_disk d5) (handempty)
   goals met: 2 of 8
11. (pick_up d4 c2)
   deleted: (on_case d4 c2) (clear_disk d4) (handempty)
   added: (clear_case c2) (holding d4)
   goals met: 2 of 8
12. (stack d4 d3)
   deleted: (clear_disk d3) (holding d4)
   added: (on_disk d4 d3) (clear_disk d4) (handempty)
   goals met: 4 of 8
13. (unstack d5 d2)
   deleted: (on_disk d5 d2) (clear_disk d5) (handempty)
   added: (clear_disk d2) (holding d5)
   goals met: 3 of 8
14. (stack d5 d4)
   deleted: (clear_disk d4) (holding d5)
   added: (on_disk d5 d4) (clear_disk d5) (handempty)
   goals met: 5 of 8
15. (unstack d2 d1)
   deleted: (on_disk d2 d1) (clear_disk d2) (handempty)
   added: (clear_disk d1) (holding d2)
   goals met: 3 of 8
16. (put_down d2 c2)
   deleted: (clear_case c2) (holding d2)
   added: (clear_disk d2) (on_case d2 c2) (handempty)
   goals met: 3 of 8
17. (unstack d5 d4)
   deleted: (on_disk d5 d4) (clear_disk d5) (handempty)
   added: (clear_disk d4) (holding d5)
   goals met: 1 of 8
18. (stack d5 d2)
   deleted: (clear_disk d2) (holding d5)
   added: (on_disk d5 d2) (clear_disk d5) (handempty)
   goals met: 2 of 8
19. (unstack d4 d3)
   deleted: (on_disk d4 d3) (clear_disk d4) (handempty)
   added: (clear_disk d3) (holding d4)
   goals met: 0 of 8
20. (stack d4 d1)
   deleted: (clear_disk d1) (holding d4)
   added: (on_disk d4 d1) (clear_disk d4) (handempty)
   goals met: 1 of 8
21. (unstack d5 d2)
   deleted: (on_disk d5 d2) (clear_disk d5) (handempty)
   added: (clear_disk d2) (holding d5)
   goals met: 0 of 8
22. (stack d5 d4)
   deleted: (clear_disk d4) (holding d5)
   added: (on_disk d5 d4) (clear_disk d5) (handempty)
   goals met: 2 of 8
23. (pick_up d3 c1)
   deleted: (on_case d3 c1) (clear_disk d3) (handempty)
   added: (clear_case c1) (holding d3)
   goals met: 1 of 8
24. (stack d3 d2)
   deleted: (clear_disk d2) (holding d3)
   added: (on_disk d3 d2) (clear_disk d3) (handempty)
   goals met: 3 of 8
25. (unstack d5 d4)
   deleted: (on_disk d5 d4) (clear_disk d5) (handempty)
   added: (clear_disk d4) (holding d5)
   goals met: 1 of 8
26. (put_down d5 c1)
   deleted: (clear_case c1) (holding d5)
   added: (clear_disk d5) (on_case d5 c1) (handempty)
   goals met: 2 of 8
27. (unstack d4 d1)
   deleted: (on_disk d4 d1) (clear_disk d4) (handempty)
   added: (clear_disk d1) (holding d4)
   goals met: 1 of 8
28. (stack d4 d3)
   deleted: (clear_disk d3) (holding d4)
   added: (on_disk d4 d3) (clear_disk d4) (handempty)
   goals met: 3 of 8
29. (pick_up d5 c1)
   deleted: (on_case d5 c1) (clear_disk d5) (handempty)
   added: (clear_case c1) (holding d5)
   goals met: 2 of 8
30. (stack d5 d4)
   deleted: (clear_disk d4) (holding d5)
   added: (on_disk d5 d4) (clear_disk d5) (handempty)
   goals met: 4 of 8
31. (pick_up d1 c3)
   deleted: (on_case d1 c3) (clear_disk d1) (handempty)
   added: (clear_case c3) (holding d1)
   goals met: 4 of 8
32. (put_down d1 c1)
   deleted: (clear_case c1) (holding d1)
   added: (clear_disk d1) (on_case d1 c1) (handempty)
   goals met: 6 of 8
33. (unstack d5 d4)
   deleted: (on_disk d5 d4) (clear_disk d5) (handempty)
   added: (clear_disk d4) (holding d5)
   goals met: 4 of 8
34. (put_down d5 c3)
   deleted: (clear_case c3) (holding d5)
   added: (clear_disk d5) (on_case d5 c3) (handempty)
   goals met: 4 of 8
35. (unstack d4 d3)
   deleted: (on_disk d4 d3) (clear_disk d4) (handempty)
   added: (clear_disk d3) (holding d4)
   goals met: 2 of 8
36. (stack d4 d1)
   deleted: (clear_disk d1) (holding d4)
   added: (on_disk d4 d1) (clear_disk d4) (handempty)
   goals met: 3 of 8
37. (pick_up d5 c3)
   deleted: (on_case d5 c3) (clear_disk d5) (handempty)
   added: (clear_case c3) (holding d5)
   goals met: 3 of 8
38. (stack d5 d4)
   deleted: (clear_disk d4) (holding d5)
   added: (on_disk d5 d4) (clear_disk d5) (handempty)
   goals met: 5 of 8
39. (unstack d3 d2)
   deleted: (on_disk d3 d2) (clear_disk d3) (handempty)
   added: (clear_disk d2) (holding d3)
   goals met: 3 of 8
40. (put_down d3 c3)
   deleted: (clear_case c3) (holding d3)
   added: (clear_disk d3) (on_case d3 c3) (handempty)
   goals met: 3 of 8
41. (unstack d5 d4)
   deleted: (on_disk d5 d4) (clear_disk d5) (handempty)
   added: (clear_disk d4) (holding d5)
   goals met: 1 of 8
42. (stack d5 d2)
   deleted: (clear_disk d2) (holding d5)
   added: (on_disk d5 d2) (clear_disk d5) (handempty)
   goals met: 2 of 8
43. (unstack d4 d1)
   deleted: (on_disk d4 d1) (clear_disk d4) (handempty)
   added: (clear_disk d1) (holding d4)
   goals met: 1 of 8
44. (stack d4 d3)
   deleted: (clear_disk d3) (holding d4)
   added: (on_disk d4 d3) (clear_disk d4) (handempty)
   goals met: 3 of 8
45. (unstack d5 d2)
   deleted: (on_disk d5 d2) (clear_disk d5) (handempty)
   added: (clear_disk d2) (holding d5)
   goals met: 2 of 8
46. (stack d5 d4)
   deleted: (clear_disk d4) (holding d5)
   added: (on_disk d5 d4) (clear_disk d5) (handempty)
   goals met: 4 of 8
47. (pick_up d2 c2)
   deleted: (on_case d2 c2) (clear_disk d2) (handempty)
   added: (clear_case c2) (holding d2)
   goals met: 4 of 8
48. (stack d2 d1)
   deleted: (clear_disk d1) (holding d2)
   added: (on_disk d2 d1) (clear_disk d2) (handempty)
   goals met: 6 of 8
49. (unstack d5 d4)
   deleted: (on_disk d5 d4) (clear_disk d5) (handempty)
   added: (clear_disk d4) (holding d5)
   goals met: 4 of 8
50. (put_down d5 c2)
   deleted: (clear_case c2) (holding d5)
   added: (clear_disk d5) (on_case d5 c2) (handempty)
   goals met: 4 of 8
51. (unstack d4 d3)
   deleted: (on_disk d4 d3) (clear_disk d4) (handempty)
   added: (clear_disk d3) (holding d4)
   goals met: 2 of 8
52. (stack d4 d2)
   deleted: (clear_disk d2) (holding d4)
   added: (on_disk d4 d2) (clear_disk d4) (handempty)
   goals met: 3 of 8
53. (pick_up d5 c2)
   deleted: (on_case d5 c2) (clear_disk d5) (handempty)
   added: (clear_case c2) (holding d5)
   goals met: 3 of 8
54. (stack d5 d3)
   deleted: (clear_disk d3) (holding d5)
   added: (on_disk d5 d3) (clear_disk d5) (handempty)
   goals met: 4 of 8
55. (unstack d4 d2)
   deleted: (on_disk d4 d2) (clear_disk d4) (handempty)
   added: (clear_disk d2) (holding d4)
   goals met: 3 of 8
56. (put_down d4 c2)
   deleted: (clear_case c2) (holding d4)
   added: (clear_disk d4) (on_case d4 c2) (handempty)
   goals met: 3 of 8
57. (unstack d5 d3)
   deleted: (on_disk d5 d3) (clear_disk d5) (handempty)
   added: (clear_disk d3) (holding d5)
   goals met: 2 of 8
58. (stack d5 d4)
   deleted: (clear_disk d4) (holding d5)
   added: (on_disk d5 d4) (clear_disk d5) (handempty)
   goals met: 4 of 8
59. (pick_up d3 c3)
   deleted: (on_case d3 c3) (clear_disk d3) (handempty)
   added: (clear_case c3) (holding d3)
   goals met: 4 of 8
60. (stack d3 d2)
   deleted: (clear_disk d2) (holding d3)
   added: (on_disk d3 d2) (clear_disk d3) (handempty)
   goals met: 6 of 8
61. (unstack d5 d4)
   deleted: (on_disk d5 d4) (clear_disk d5) (handempty)
   added: (clear_disk d4) (holding d5)
   goals met: 4 of 8
62. (put_down d5 c3)
   deleted: (clear_case c3) (holding d5)
   added: (clear_disk d5) (on_case d5 c3) (handempty)
   goals met: 4 of 8
63. (pick_up d4 c2)
   deleted: (on_case d4 c2) (clear_disk d4) (handempty)
   added: (clear_case c2) (holding d4)
   goals met: 4 of 8
64. (stack d4 d3)
   deleted: (clear_disk d3) (holding d4)
   added: (on_disk d4 d3) (clear_disk d4) (handempty)
   goals met: 6 of 8
65. (pick_up d5 c3)
   deleted: (on_case d5 c3) (clear_disk d5) (handempty)
   added: (clear_case c3) (holding d5)
   goals met: 6 of 8
66. (stack d5 d4)
   deleted: (clear_disk d4) (holding d5)
   added: (on_disk d5 d4) (clear_disk d5) (handempty)
   goals met: 8 of 8
